# RebarShapeId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarInSystem..::..RebarShapeId Property
RebarInSystem Class See Also
---
The RebarShape element that defines the shape of the rebar.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId RebarShapeId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property RebarShapeId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ RebarShapeId {
	ElementId^ get ();
}
```

# See Also
RebarInSystem Class
Autodesk.Revit.DB.Structure Namespace